**vithu jadhav , Roll no - 50 , CSE(AI&ML)**

In [1]:
#Handling NULL values
#isnull()
import pandas as pd
import numpy as np

In [2]:
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
# creating a dataframe from list
df = pd.DataFrame(dict)

In [3]:
# creating a dataframe from list
df = pd.DataFrame(dict)

In [4]:
# using isnull() function  
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [5]:
#df.notnull()
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [6]:
#Fillnull values with the previous ones
df.fillna(method ='pad')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [7]:
#Fillnull values with the afters ones
df.fillna(method ='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [8]:
#replace()
df.replace(to_replace = np.nan, value = -99)

   First Score  Second Score  Third Score
0        100.0          30.0        -99.0
1         90.0          45.0         40.0
2        -99.0          56.0         80.0
3         95.0         -99.0         98.0

In [9]:
#Using interpolate() function to fill the missing values using linear method.
df.interpolate(method ='linear', limit_direction ='forward')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         92.5          56.0         80.0
3         95.0          56.0         98.0

In [10]:
#dropna()
df.dropna()

   First Score  Second Score  Third Score
1         90.0          45.0         40.0

In [11]:
#Merge
left = pd.DataFrame({  
   'id':[1,2,3,4],  
   'Name': ['John', 'Parker', 'Smith', 'Parker'],  
   'subject_id':['sub1','sub2','sub4','sub6']})  
right = pd.DataFrame({  
    'id':[1,2,3,4],  
   'Name': ['William', 'Albert', 'Tony', 'Allen'],  
   'subject_id':['sub2','sub4','sub3','sub6']})  
print (left)  
print (right)

   id    Name subject_id
0   1    John       sub1
1   2  Parker       sub2
2   3   Smith       sub4
3   4  Parker       sub6
   id     Name subject_id
0   1  William       sub2
1   2   Albert       sub4
2   3     Tony       sub3
3   4    Allen       sub6

In [12]:
#Join
info = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],  
'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})  
x = pd.DataFrame({'key': ['K0', 'K1', 'K2'],  
'B': ['B0', 'B1', 'B2']})  
info.join(x, lsuffix='_caller', rsuffix='_x')   
info.set_index('key').join(x.set_index('key'))  
info.join(x.set_index('key'), on='key')

  key   A    B
0  K0  A0   B0
1  K1  A1   B1
2  K2  A2   B2
3  K3  A3  NaN
4  K4  A4  NaN
5  K5  A5  NaN

In [13]:
#Aggregation
info=pd.DataFrame([[1,5,7],[10,12,15],[18,21,24],[np.nan,np.nan,np.nan]],columns=['X','Y','Z'])  
info.agg(['sum','min'])

        X     Y     Z
sum  29.0  38.0  46.0
min   1.0   5.0   7.0

In [14]:
#Grouping
data = {'Name': ['Parker', 'Smith', 'John', 'William'],  
   'Percentage': [82, 98, 91, 87],  
   'Course': ['B.Sc','B.Ed','M.Phill','BA']}  
df = pd.DataFrame(data)  
grouped = df.groupby('Course')  
print(grouped['Percentage'].agg(np.mean))

Course
B.Ed       98.0
B.Sc       82.0
BA         87.0
M.Phill    91.0
Name: Percentage, dtype: float64

In [16]:
#Pivot Tables
# create dataframe   
info = pd.DataFrame({'P': ['Smith', 'John', 'William', 'Parker'],   
      'Q': ['Python', 'C', 'C++', 'Java'],   
      'R': [19, 24, 22, 25]})   
info   
table = pd.pivot_table(info, index =['P', 'Q'])     
table

                 R
P       Q
John    C       24
Parker  Java    25
Smith   Python  19
William C++     22